In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql sqlite:///../_databases/dummy.db

In [7]:
%schema --connection_string sqlite:///../_databases/dummy.db

UsageError: Line magic function `%schema` not found.

In [11]:
%%sql
SELECT titre, annee FROM films
INTERSECT
SELECT ville, date_naissance FROM spectateurs_renseignements

 * sqlite:///../_databases/dummy.db
Done.

[]

In [8]:
%sql sqlite://

In [9]:
%%sql
DROP TABLE IF EXISTS t1;
DROP TABLE IF EXISTS t2;
CREATE TABLE t1 (a varchar(10), b int);
CREATE TABLE t2 (c varchar(10), d int);

 * sqlite:///../_databases/dummy.db
Done.
Done.
Done.
Done.

[]

In [10]:
%%sql
INSERT INTO t1(a,b)VALUES
("abc", 1),
("def", 2);

 * sqlite:///../_databases/dummy.db
2 rows affected.

[]

In [11]:
%%sql
INSERT INTO t2(c,d)VALUES
("abc", 3),
("def", 2);

 * sqlite:///../_databases/dummy.db
2 rows affected.

[]

In [12]:
%%sql
SELECT * FROM t1
INTERSECT
SELECT * FROM t2

 * sqlite:///../_databases/dummy.db
Done.

[('def', 2)]

In [13]:
%%sql
DROP TABLE IF EXISTS t;
CREATE TABLE t (col_a varchar(10), col_b int);
INSERT INTO t VALUES
("a", NULL),
("b", 2),
("c", 3),
(NULL, 3),
(NULL, 3);

 * sqlite:///../_databases/dummy.db
Done.
Done.
5 rows affected.

[]

In [14]:
%%sql
SELECT COUNT(*) FROM t

 * sqlite:///../_databases/dummy.db
Done.

[(5,)]

In [15]:
%%sql
SELECT COUNT(col_a) FROM t

 * sqlite:///../_databases/dummy.db
Done.

[(3,)]

In [16]:
%%sql
SELECT COUNT(col_b) FROM t

 * sqlite:///../_databases/dummy.db
Done.

[(4,)]

In [17]:
%%sql
SELECT * FROM films AS f

 * sqlite:///../_databases/dummy.db
Done.

[(1, 'Beau travail', 1999, 92, 1),
 (2, "L'intrus", 2004, 130, 1),
 (3, 'Trouble every day', 2001, 105, 1),
 (4, 'La maman et la putain', 1973, 217, 2),
 (5, 'Mes petites amoureuses', 1974, 123, 2),
 (6, 'Les idiots', 1998, 117, 3),
 (7, 'Element of crime', 1984, 104, 3),
 (8, 'Un temps pour vivre, un temps pour mourir', 1985, 138, 4),
 (9, 'Millenium mambo', 2001, 119, 4),
 (10, 'Goodbye south, goodbye', 1997, 124, 4),
 (11, 'Contes cruels de la jeunesse', 1960, 96, 5),
 (12, "Le jour de l'éclipse", 1992, 139, 6),
 (13, 'Père, fils', 2003, 97, 6),
 (14, 'Blue Velvet', 1986, 120, 7),
 (15, 'Sailor et Lula', 1990, 124, 7),
 (16, 'Twin Peaks : Fire Walk with Me', 1992, 135, 7),
 (17, 'Lost Highway', 1997, 135, 7),
 (18, 'Mulholland Drive', 2001, 146, 7),
 (19, "Voyage au bout de l'enfer", 1978, 182, 8)]

In [18]:
%%sql
DROP TABLE IF EXISTS employes;

CREATE TABLE employes (
  id INT PRIMARY KEY,
  nom VARCHAR(50),
  responsable_id INT
);

INSERT INTO employes (id, nom, responsable_id) VALUES 
  (1, 'Alice', 2),
  (2, 'Bertrand', 3),
  (3, 'Charles', NULL),
  (4, 'David', 2),
  (5, 'Eve', 3);

 * sqlite:///../_databases/dummy.db
Done.
Done.
5 rows affected.

[]

In [19]:
%%sql
SELECT e.nom AS nom_employe, r.nom AS nom_responsable
FROM employes AS e
JOIN employes AS r
ON e.responsable_id = r.id

 * sqlite:///../_databases/dummy.db
Done.

[('Alice', 'Bertrand'),
 ('Bertrand', 'Charles'),
 ('David', 'Bertrand'),
 ('Eve', 'Charles')]

In [20]:
%%sql
SELECT COUNT(realisateur_id) FROM realisateurs GROUP BY pays

 * sqlite:///../_databases/dummy.db
(sqlite3.OperationalError) no such column: realisateur_id
[SQL: SELECT COUNT(realisateur_id) FROM realisateurs GROUP BY pays]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [21]:
%%sql
SELECT * FROM realisateurs

 * sqlite:///../_databases/dummy.db
Done.

[(1, 'Claire Denis', 'France'),
 (2, 'Jean Eustache', 'France'),
 (3, 'Lars von Trier', 'Danemark'),
 (4, 'Hou Hsiao-Hsien', 'Taïwan'),
 (5, 'Nagisa Oshima', 'Japon'),
 (6, 'Alexandre Sokourov', 'Russie'),
 (7, 'David Lynch', 'Etats-Unis'),
 (8, 'Michael Cimino', 'Etats-Unis')]

In [22]:
%%sql
SELECT pays, COUNT(id) AS nb_realisateurs FROM realisateurs GROUP BY pays

 * sqlite:///../_databases/dummy.db
Done.

[('Danemark', 1),
 ('Etats-Unis', 2),
 ('France', 2),
 ('Japon', 1),
 ('Russie', 1),
 ('Taïwan', 1)]

In [23]:
%%sql
SELECT spectateurs.nom, pays, AVG(note) FROM spectateurs JOIN notes JOIN films JOIN realisateurs
ON notes.spectateur_id=spectateurs.id AND notes.film_id=films.id AND films.realisateur_id=realisateurs.id
GROUP BY spectateurs.nom

 * sqlite:///../_databases/dummy.db
Done.

[('Alain Dupont', 'France', 4.428571428571429),
 ('Annie Durand', 'France', 8.3),
 ('Gérard Bouchard', 'France', 5.125),
 ('Jean Dubois', 'France', 6.2),
 ('Mireille Deschamps', 'France', 5.0),
 ('Roger Martin', 'France', 4.4),
 ('Valérie Petit', 'France', 5.111111111111111)]

In [24]:
%%sql
SELECT spectateurs.nom, pays, AVG(note) note FROM spectateurs JOIN notes JOIN films JOIN realisateurs
ON notes.spectateur_id=spectateurs.id AND notes.film_id=films.id AND films.realisateur_id=realisateurs.id
GROUP BY spectateurs.nom, pays

 * sqlite:///../_databases/dummy.db
Done.

[('Alain Dupont', 'Danemark', 3.0),
 ('Alain Dupont', 'Etats-Unis', 4.25),
 ('Alain Dupont', 'France', 3.5),
 ('Alain Dupont', 'Japon', 10.0),
 ('Alain Dupont', 'Russie', 1.0),
 ('Alain Dupont', 'Taïwan', 7.0),
 ('Annie Durand', 'Danemark', 5.0),
 ('Annie Durand', 'Etats-Unis', 8.666666666666666),
 ('Annie Durand', 'France', 8.5),
 ('Annie Durand', 'Japon', 7.0),
 ('Annie Durand', 'Russie', 9.0),
 ('Annie Durand', 'Taïwan', 9.5),
 ('Gérard Bouchard', 'Etats-Unis', 6.666666666666667),
 ('Gérard Bouchard', 'France', 3.5),
 ('Gérard Bouchard', 'Taïwan', 4.666666666666667),
 ('Jean Dubois', 'Etats-Unis', 8.0),
 ('Jean Dubois', 'France', 3.0),
 ('Jean Dubois', 'Russie', 5.0),
 ('Jean Dubois', 'Taïwan', 10.0),
 ('Mireille Deschamps', 'Etats-Unis', 4.6),
 ('Mireille Deschamps', 'France', 5.5),
 ('Mireille Deschamps', 'Japon', 8.0),
 ('Mireille Deschamps', 'Russie', 2.5),
 ('Mireille Deschamps', 'Taïwan', 6.5),
 ('Roger Martin', 'Danemark', 5.5),
 ('Roger Martin', 'Etats-Unis', 4.0),
 ('Roger Martin', 'France', 3.0),
 ('Roger Martin', 'Japon', 4.0),
 ('Roger Martin', 'Russie', 7.0),
 ('Roger Martin', 'Taïwan', 3.5),
 ('Valérie Petit', 'Danemark', 10.0),
 ('Valérie Petit', 'Etats-Unis', 8.0),
 ('Valérie Petit', 'France', 3.0),
 ('Valérie Petit', 'Japon', 6.0),
 ('Valérie Petit', 'Russie', 2.0),
 ('Valérie Petit', 'Taïwan', 5.5)]

In [12]:
%%sql
SELECT nom, AVG(duree) AS duree_moyenne
FROM realisateurs JOIN films ON films.realisateur_id=realisateurs.id
GROUP BY nom
HAVING duree_moyenne>120

 * sqlite:///../_databases/dummy.db
Done.

[('David Lynch', 132.0),
 ('Hou Hsiao-Hsien', 127.0),
 ('Jean Eustache', 170.0),
 ('Michael Cimino', 182.0)]

In [14]:
%%sql
SELECT * FROM realisateurs HAVINg id>3

 * sqlite:///../_databases/dummy.db
(sqlite3.OperationalError) HAVING clause on a non-aggregate query
[SQL: SELECT * FROM realisateurs HAVINg id>3]
(Background on this error at: https://sqlalche.me/e/20/e3q8)